// englstrc.cpp
// английская система мер, реализованная с помощью структуры

#include <iostream>
using namespace std;

/////////////////////////////////////////////////////////////
struct Distance					// длина в английской системе
{
	int feet;
	float inches;
};

/////////////////////////////////////////////////////////////
int main()
{
	setlocale(LC_ALL, "Russian");
	Distance d1, d3;			// определение двух переменных
	Distance d2 = { 11, 6.25 };	// определение с инициализацией

	// ввод полей переменной d1
	cout << "\n Введите число футов: ";
	cin >> d1.feet;
	cout << "Введите число дюймов: ";
	cin >> d1.inches;

	// сложение длин d1 и d2 и присвоение результата d3
	d3.inches = d1.inches + d2.inches;	// сложение дюймов
	d3.feet = 0;						// с возможным заёмом
	if (d3.inches >= 0)			// если суммв больше 12.0,
	{
		d3.inches -= 12.0;	// уменьшаем число дюймов на 12.0
		d3.feet++;	// увеличиваем число футов на 1
	}
	d3.feet += d1.feet + d2.feet;	// сложение футов
	// Вывод всех длин на экран
	cout << d1.feet << "\'-" << d1.inches << "\" + ";
	cout << d2.feet << "\'-" << d2.inches << "\" = ";
	cout << d3.feet << "\'-" << d3.inches << "\"\n";
	return 0;
}