// retref.cpp
// возвращение значения по ссылке

#include <iostream>
using namespace std;

int x;						// глобальная переменная

////////////////////////////////////////////////////////////////////////
int& setx();				// прототип функции

////////////////////////////////////////////////////////////////////////
int main()
{							// присваивание значения x при
	setx() = 92;			// помощи вызова функции слева
	cout << "x = " << x << endl;	// вывод нового значения х
	return 0;
} 

// ----- функция int& setx() -------------------------------------------
int& setx()
{
	return x;			// возвращает значение, которое будет изменено
}