// overload.cpp
// перегрузка функции

#include <iostream>
using namespace std;

///////////////////////////////////////////////////////////////////
void repchar();				// прототип
void repchar(char);
void repchar(char, int);

///////////////////////////////////////////////////////////////////
int main()
{
	repchar();
	repchar('=');
	repchar('+', 30);
	return 0;
}

// ----- функци€ rephar() -----------------------------------------
// вывод на экран 45 символов '*'
void repchar()
{
	for (int j = 0; j < 45; j++)	// цикл, выполн€ющийс€ 45 раз
		cout << '*';				// вывод символа *
	cout << endl;
}
// ----------------------------------------------------------------

// ----- функци€ repchar() ----------------------------------------
// вывод 45 заданных символов
void repchar(char ch)
{
	for (int j = 0; j < 45; j++)	// цикл, выполн€ющийс€ 45 раз
		cout << ch;					// вывод заданого символа
	cout << endl;
}
// -----------------------------------------------------------------

// ----- функци€ repchar() -----------------------------------------
// функци€ repchar()
// выводит заданный символ заданное число раз
void repchar(char ch, int n)
{
	for (int j = 0; j < n; j++)		// цикл, выполн€ющийс€ n раз
		cout << ch;
	cout << endl;
}