// constarg.cpp
// демонстрирует константные аргументы функций

////////////////////////////////////////////////////////////////////////
void aFunc(int& a, const int& b);			// прототип функций

////////////////////////////////////////////////////////////////////////
int main()
{
	int alpha = 7;
	int beta = 11;
	aFunc(alpha, beta);			// вызов функции
	return 0;
}

// ----- функция aFunc() -----------------------------------------------
void aFunc(int& a, const int& b)			// определение функции
{
	a = 107;		// корректно
	b = 111;		// ошибка при попытке
	// изменить константный аргумент
}