// static.cpp
// демонстрирует статические локальные переменные

#include <iostream>
using namespace std;

////////////////////////////////////////////////////////////////////////
float getavg(float);	// прототип функции

////////////////////////////////////////////////////////////////////////
int main()
{
	setlocale(LC_ALL, "Russian");
	float data = 1, avg;
	while (data != 0)
	{
		cout << "Введите число: ";
		cin >> data;
		avg = getavg(data);
		cout << "Среднее значение: " << avg << endl;
	}
	return 0;
}

// ----- функция getavg() ------------------------------------------------
// находит среднее арифметическое всех введёных значений
float getavg(float newdata)
{
	static float total = 0;			// инициализация статических
	static int  count = 0;			// переменных при первом вызове
	count++;		// увеличение счётчика
	total += newdata;			// добавление нового значение к сумме
	return total / count;		// возврат нового среднего значения
}